Public Attributes | List of all members
API_AnalyticalSupportType Struct Reference
Analytical Model
Describes a Structural Analytical Model Member Support. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_AnalyticalSupport_Settings  | supportSettings
The Analytical Support settings.
API_AnalyticalMemberPartRef  | supportedMemberPartRef
The Analytical Member part reference where the Analytical Support is applied.
Detailed Description
Describes a Structural Analytical Model Member Support.
Since
Archicad 25
Member Data Documentation
◆ supportedMemberPartRef
 API_AnalyticalSupportType::supportedMemberPartRef
The Analytical Member part reference where the Analytical Support is applied.
◆ supportSettings
 API_AnalyticalSupportType::supportSettings
The Analytical Support settings.